Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དེ་བཞིན་དུ་འདུག་པ་ལས། དེའི་ཚེ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཡིན་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ངེས་པར་བྱེད་དོ། །ཆོས་ཐམས་ཅད་རྣམ་པར་དབེན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་གཡོ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་སེམས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མི་ནོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་རོ་གཅིག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་འགག་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱ་མཚོ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རི་རབ་རྣམ་པ་སྣ་ཚོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུགས་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སའི་ཁམས་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་།
en: Then the bodhisattva great being Sadāprarudita sat down in the same manner, and at that time he established certainty in (1) the meditative stability named sameness of all phenomena owing to the sameness of all phenomena.

source: རླུང་གི་ཁམས་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའི་ཁམས་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མི་ཕྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དམིགས་སུ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་འཇིག་པ་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་སྤྱོད་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་རྣམ་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བཤད་པ་ན་རབ་ཏུ་ཐོབ་པར་འགྱུར་ཏེ།
en: And when the perfection of wisdom was explained, he attained (2) the meditative stability named voidness of all phenomena, (3) the meditative stability named motionlessness of all phenomena, (4) the meditative stability named absence of mentation in all phenomena, (5) the meditative stability named imperturbability of all phenomena, (6) the meditative stability named common savor of all phenomena, (7) the meditative stability named infinitude of all phenomena, (8) the meditative stability named nonarising of all phenomena, (9) the meditative stability named nonceasing of all phenomena, (10) the meditative stability named infinite space, (11) the meditative stability named infinite ocean, (12) the meditative stability named multifacetedness of Mount Sumeru, (13) the meditative stability named sky-like, (14) the meditative stability named boundlessness of physical forms, (15) the meditative stability named boundlessness of feelings, perceptions, formative predispositions, and consciousness, (16) the meditative stability named boundlessness of the earth element, (17) the meditative stability named boundlessness of the water element, the fire element, and the wind element, (18) the meditative stability named boundlessness of the space element, (19) the meditative stability named vajra-like, (20) the meditative stability named nondifferentiation of all phenomena, (21) the meditative stability named nonapprehensibility of the essential nature of all phenomena, (22) the meditative stability named sameness of the irreducibility of all phenomena, (23) the meditative stability named inactivity of all phenomena, and (24) the meditative stability named inconceivability of all phenomena.

source: དེ་ལ་སོགས་པ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྟོང་ཕྲག་དྲུག་ཅུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ཆོས་ཀྱིས་འཕགས་པའི་ལེའུ་སྟེ། བདུན་ཅུ་རྩ་ལྔ་པའོ།། །།རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་ཐོབ་མ་ཐག་ཏུ་ཤར་ཕྱོགས་དང་། ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། མཚམས་རྣམས་དང་།
en: Beginning with these [twenty-four], the bodhisattva great being Sadāprarudita altogether attained six million gateways of meditative stability.”

source: བླ་འོག་དང་།
en: This completes the seventy-fifth chapter, “Dharmodgata,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.” {

source: ཕྱོགས་བཅུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་མདུན་དུ་བྱས་པ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ། ཚུལ་འདི་ཉིད་དང་། མིང་འདི་ཉིད་དང་། ཚིག་འདི་ཉིད་དང་། ཡི་གེ་འདི་དག་ཉིད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་འཆད་པ་མཐོང་བ་ནི། དཔེར་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་ང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་མདུན་དུ་བྱས་ཤིང་།
en: Va.260} Chapter 76: Entrustment “Subhūti, immediately after the bodhisattva great being Sadāprarudita had attained those six million gateways of meditative stability, he saw the lord buddhas accompanied by hosts of bodhisattvas and surrounded by the community of monks, teaching this same perfection of wisdom, in these very ways, in these very terms, in these very words, and in these very letters, in the world systems of the great trichiliocosm of the ten directions—east, south, west, north, the intermediate directions, the zenith, and the nadir—numerous as the grains of sand of the river Gaṅgā, just as I, accompanied by hosts of bodhisattvas and surrounded by the community of monks, am now teaching the Dharma of the perfection of wisdom in these very ways, in these very terms, in these very words, and in these very letters, in this world system of the great trichiliocosm.

source: དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ། ཚུལ་འདི་ཉིད་དང་མིང་འདི་ཉིད་དང་། ཚིག་འདི་ཉིད་དང་ཡི་གེ་འདི་དག་ཉིད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་འཆད་ཅིང་འདུག་པ་ལྟ་བུའོ། །དེ་བསམ་གྱིས་མི་ཁྱབ་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པས་ཐོས་པ་རྒྱ་མཚོ་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏོ།
en: By attaining inconceivable dhāraṇīs, he acquired learning as vast as the oceans.

source: །ཚེ་རབས་ཐམས་ཅད་དུ་ཡང་ནམས་ཀྱང་སངས་རྒྱས་དང་མི་འབྲལ་བར་གྱུར་ཏོ།
en: In all his lives he was never again separated from the buddhas.

source: །ཚེ་རབས་ཐམས་ཅད་དུ་གང་དང་གང་དུ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་དེར་སྐྱེས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མངོན་སུམ་དུ་ཆོས་ཉན་ཏོ།
en: In all his lives, he was reborn in those world systems where the lord buddhas were present, and he listened to the Dharma in the actual presence of the lord buddhas.

source: །ཆུང་ངུ་ན་རྨི་ལམ་ན་ཡང་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བ་དང་།
en: At the very least, even in his dreams he was never separated from the vision of the buddhas.

source: ཆོས་ཉན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དང་མི་འབྲལ་ལོ།
en: He would hear the Dharma and was never separated from the sight of bodhisattvas.

source: །དེ་མི་ཁོམ་པ་ཐམས་ཅད་སྤངས་ཤིང་དལ་འབྱོར་དང་ལྡན་པར་གྱུར་ཏོ།
en: He abandoned all states lacking freedom, and possessed the freedoms and opportunities.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་རྣམ་གྲངས་འདིས་འདི་ལྟར་རིག་པར་བྱའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པའོ།
en: Then the Blessed One said to the venerable Ānanda, “You should know, Ānanda, as this formulation explains, that the perfection of wisdom facilitates the attainment of omniscient gnosis.

source: །དེ་བས་ན་ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱད་པར་བྱའོ།
en: Therefore, Ānanda, all bodhisattva great beings who want to attain omniscient gnosis should practice this perfection of wisdom.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཟུང་ཤིག།
en: Then he said to Ānanda, “In order to benefit bodhisattva great beings, you, Ānanda, should take up this perfection of wisdom.

source: ཆོངས་ཤིག། ལྷོགས་ཤིག། ཀུན་ཆུབ་པར་གྱིས་ཤིག། གཞན་ལ་ཡང་རྒྱས་པར་སྟོན་ཅིག།
en: Uphold it, recite it, master it, and teach it extensively to others.

source: ཀུན་དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཀྱང་མཉན་པར་བྱ། གཟུང་བར་བྱ། བཅང་བར་བྱ། ཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ། བསྒྲགས་པར་བྱ། བསྟན་པར་བྱ། བཤད་པར་བྱ། ཁ་ཏོན་དུ་བྱ།
en: Ānanda, this perfection of wisdom should be heard, taken up, upheld, recited, mastered, chanted, taught, explained, repeated, and cultivated by bodhisattva great beings.

source: རབ་ཏུ་བསྒོམ་པར་བྱ་སྟེ། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་ཀྱིས་ཆུང་ངུ་ན། གླེགས་བམ་ཆེན་པོ་ལ་ཡི་གེ་གསལ་བར་བྲིས་ཏེ། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ཁོ་ར་ཁོར་ཡུག་ཏུ་ཡང་མར་མེའི་ཕྲེང་བ་རྣམ་པ་དུ་མས་མཆོད་ཅིང་།
en: Through the blessing of the tathāgatas, at the very least, it should be clearly written down, and offerings should be made to it with flowers, incense, perfume, garlands, unguents, powders, clothing, parasols, victory banners, ribbons, and many rows of butter lamps on all sides.

source: རིམ་གྲོར་བྱ། བླ་མར་བྱ། བསྟི་སྟང་དུ་བྱ། མཆོད་པར་བྱ། བརྗེད་པར་བྱ།
en: It should be served, honored, venerated, worshiped, revered, and respected.

source: གུས་པར་བྱ་སྟེ། འདི་ནི་ངས་རྗེས་སུ་གདམས་པའོ།
en: This is my admonition.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རག་ལུས་པའི་ཕྱིར་རོ།
en: If you ask why, Ānanda, it is because the unsurpassed, complete enlightenment of bodhisattva great beings depends on the perfection of wisdom.

source: །ཀུན་དགའ་བོ་དེ་ཇི་སྙམ་དུ་སེམས། ཁྱོད་ཀྱི་སྟོན་པ་དེ་བཞིན་གཤེགས་པ་ཡིན་ནམ།
en: Ānanda, do you think that your teacher is the Tathāgata?” “

source: ཀུན་དགའ་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གི་སྟོན་པ་ལགས་སོ།
en: Blessed Lord, he is my teacher!” replied Ānanda.

source: །བདེ་བར་གཤེགས་པ་བདག་གི་སྟོན་པ་ལགས་སོ། །དེ་སྐད་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་ཁྱོད་ཀྱི་སྟོན་པ་ཡིན་ཏེ། ཁྱོད་ཀྱིས་ཡོངས་སུ་སྤྱད་དོ།
en: The Blessed One then said to the venerable Ānanda, “The Tathāgata is your teacher, Ānanda!

source: །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྱམས་པའི་ལུས་ཀྱི་ལས་ཡིད་དུ་འོང་ཞིང་། ཡིད་དུ་མི་འོང་བ་མ་ཡིན་པ་དང་། བྱམས་པའི་དག་གི་ལས་ཡིད་དུ་འོང་ཞིང་ཡིད་དུ་མི་འོང་བ་མ་ཡིན་པ་དང་། བྱམས་པའི་ཡིད་ཀྱི་ལས་ཡིད་དུ་འོང་ཞིང་ཡིད་དུ་མི་འོང་བ་མ་ཡིན་པས་ཡོངས་སུ་སྤྱད་དོ།
en: You have conducted yourself, Ānanda, with physical acts of loving kindness that are pleasant and never unpleasant, with verbal acts of loving kindness that are pleasant and never unpleasant, and with mental acts of loving kindness that are pleasant and never unpleasant.

source: །དེ་བས་ན་ཀུན་དགའ་བོ་ང་ད་ལྟར་ལུས་འདི་ལ་གནས་ཤིང་འཚོ་སྐྱོང་བ་ན། གང་ཁྱོད་ཀྱིས་བྱམས་པ་དང་དགའ་བ་དང་། བླ་མར་བྱས་པ་དེ། ད་འདས་པའི་འོག་ཏུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གྱིས་ཤིག །
en: Therefore, Ānanda, just as you have acted with loving kindness, empathetic joy, and reverence toward me while I am alive in this present incarnation, after I have passed away, you should similarly act toward this perfection of wisdom.

source: ཀུན་དགའ་བོ་ཁྱོད་ལ་ལན་གཉིས་ལན་གསུམ་དུ་གཏད་ཅིང་རྗེས་སུ་གཏད་ཀྱིས།
en: Ānanda, I entrust and transmit this to you for the second time and for the third time.

source: ཁྱོད་ཀྱིས་ཅི་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མེད་པར་མི་འགྱུར་བར་གྱིས་ཤིག །
en: Come what may, you should ensure that this perfection of wisdom does not vanish.

source: ཀུན་དགའ་བོ་ཇི་སྲིད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཇིག་རྟེན་ན་གནས་པ་དེ་སྲིད་དུ་དེ་བཞིན་གཤེགས་པ་ཡང་བཞུགས་པར་རིག་པར་བྱ། དེ་སྲིད་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་འཆད་པར་རིག་པར་བྱའོ། །ཀུན་དགའ་བོ་སེམས་ཅན་གང་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉན་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། སྒྲོགས་པ་དང་།
en: Ānanda, as long as this perfection of wisdom remains in the world, you should know that for that long the tathāgatas will also be present.

source: སྟོན་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། འདྲི་བ་དང་། རིམ་གྲོར་བྱེད་པ་དང་། བླ་མར་བྱེད་པ་དང་། བསྟི་སྟང་དུ་བྱེད་པ་དང་། མཆོད་པར་བྱེད་པ་དང་། རྗེད་པར་བྱེད་པ་དང་། གུས་པར་བྱེད་ཅིང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གོས་དང་།
en: You should know that for that long the tathāgatas will teach the Dharma.

source: ཕྱེ་མ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ཁོ་ར་ཁོར་ཡུག་ཏུ་མར་མེའི་ཕྲེང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་མཆོད་པས་མཆོད་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་ནི་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བ།
en: Ānanda, you should know that those beings {Va.261} who listen to this perfection of wisdom, and who take up, uphold, recite, master, chant, teach, repeat, question, serve, honor, respect, worship, revere, and venerate it, presenting it with diverse offerings—flowers, incense, perfume, garlands, unguents, clothing, powders, parasols, victory banners, ribbons, and rows of butter lamps on all sides—will never be separated from the sight of the buddhas.

source: ཆོས་ཉན་པ་དང་མི་འབྲལ་བར་རིག་པར་བྱའོ།
en: They will never be separated from hearing the Dharma. “

source: །ཀུན་དགའ་བོ་སེམས་ཅན་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་ཞམ་རིང་བར་འཁོད་པར་རིག་པར་བྱའོ། །བཅོམ་ལྡན་འདས་ཐུགས་དགྱེས་པས་དེ་སྐད་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དང་། ཚེ་དང་ལྡན་པ་ཤ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་ཆེན་པོའི་བུ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུངས་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀ་ཏ་ཡ་ན་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་མ་འགགས་པ་དང་། ཚེ་དང་ལྡན་པ་རེ་བ་ཏ་དང་། ཚེ་དང་ལྡན་པ་རཱ་ཧུ་ལ་དང་།
en: Ānanda, you should know that those beings will be the servants of the tathāgatas!”

source: འཁོར་རྣམ་བཞི་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་དགའ་བར་གྱུར་ཏོ།
en: When the Blessed One had joyfully spoken these words, the venerable Ānanda, the venerable Śāradvatīputra, the venerable Mahā­maudgalyāyana, the venerable Mahākāśyapa, the venerable Pūrṇa Maitrāyaṇīputra, the venerable Mahākātyāyana, the venerable Aniruddha, the venerable Revata, the venerable Rāhula, and all four assemblies, along with mundane beings including gods, humans, and asuras, rejoiced in the words spoken by the Blessed One.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ཡོངས་སུ་གཏད་པའི་ལེའུ་སྟེ། བདུན་ཅུ་རྩ་དྲུག་པའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: This completes the seventy-sixth chapter, “Entrustment,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་གྱི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་དང་།
en: This completes “The Perfection of Wisdom in Twenty-Five Thousand Lines,” which is the mother of the past, future, and present buddhas, bodhisattvas, śrāvakas, and pratyekabuddhas, in all the limitless world systems of the ten directions.

source: རང་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ་རྫོགས་སྷོ།། །།ཉི་ཁྲི་འདི་དགེ་བའི་བཤེས་གཉེན་མྱང་སྒོམ་ཆོས་འབར་གྱི་ཐུགས་དམ་གསེར་ཁྲི་ལ་ཕྱི་མོ་བྱས་ནས་ཞུས་དག་ལན་གཉིས་དང་། ཉི་ཁྲི་ཡེར་པ་མའི་སྟེང་ནས་ཞུས་དག་ལེགས་པར་བགྱིས་བདོག་པས།
en: It is said in the original Jangpa manuscript: This [Tibetan translation of] The Perfection of Wisdom in Twenty-Five Thousand Lines has been edited twice on the basis of the original “gold manuscript,” which had been [commissioned as] a commitment of the spiritual mentor Nyanggom Chobar, and it has also been edited on the basis of the manuscript kept at Yerpa.

source: སླན་ཆད་བྲི་བ་རྣམས་ཀྱང་འདི་ཁོ་ན་བཞིན་བྲི་བར་བྱའོ། །ཞེས་མ་ཕྱི་འཇང་པར་ལས་བྱུང་ཞིང་།
en: Since it is extant, scribes of posterity should copy [the text] according to this version alone.

source: སློབ་དཔོན་སེང་གེ་བཟང་པོས་ཞུས་དག་མཛད་པའི་ཉི་ཁྲི་དང་དཔེ་ལ་ལར་ཆོས་ཉིད་མི་འགྱུར་བའི་ལེའུ་སྟེ་བདུན་ཅུ་རྩ་གཅིག་པའོ་ཞེས་པ་ཡན་ལས་མི་འདུག །
en: In the [recast] version of The Perfection of Wisdom in Twenty-Five Thousand Lines [Toh 3790] that was edited by master Haribhadra, and in some [other] manuscripts, the text ends with the seventy-first chapter entitled “Unchanging Reality.”

source: འདིའི་ཕྱི་མོ་སོགས་དཔེ་ལ་ལར་དེའི་སྟེང་དུ། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་རབ་ཏུ་ཕྱེ་བའི་ལེའུ། བྱང་ཆུབ་སེམས་དཔའ་རྟག་པར་རབ་ཏུ་ངུ་བས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་ཐོབ་པའི་ལེའུ།
en: In certain [other] manuscripts, including the original (phyi mo) [Toh 9], there are seventy-six chapters, with the addition of the [seventy-second] chapter entitled “Distinctions in the Training of a Bodhisattva,” the [seventy-third] chapter entitled “The Attainment of the Manifold Gateways of Meditative Stability by the Bodhisattva Sadāprarudita,” the [seventy-fourth] chapter entitled “Sadāprarudita,” the [seventy-fifth] chapter entitled “Dharmodgata,” and the [seventy-sixth] chapter entitled “Entrustment.”

source: རྟག་པར་རབ་ཏུ་ངུ་བའི་ལེའུ། ཆོས་འཕགས་ཀྱི་ལེའུ། ཡོངས་སུ་གཏད་པའི་ལེའུ་སྟེ་བདུན་ཅུ་རྩ་དྲུག་འདུག་པ་སྔོན་གྱི་ལོ་རྒྱུས་དང་གསན་ཡིག་ཁུངས་མ་རྣམས་དང་མཐུན་འོན་ཀྱང་ལེའུ་ཕྱི་མ་ལྔ་པོ་འདི་འགྱུར་ཁྱད་ལྟ་བུའི་དོན་ལ་ཁྱད་མེད་ཀྱང་ཚིག་ཅུང་ཟད་མི་འདྲ་བའི་དཔེ་གསུམ་ཙམ་མཐོང་།
en: This accords with earlier accounts and the authentic records of teachings received. Insofar as there are distinctions in the translation of these five later chapters, I have seen a few manuscripts where the terminology is slightly dissimilar, although there are no differences in meaning.

source: ལར་དཔེ་འདི་ཉིད་ཀྱི་དབུ་ཞབས་ཐམས་ཅད་དུ་གཞན་དང་ཚིག་ཟུར་མི་འདྲ་བ་དང་ཚིག་སྣ་རིང་ཐུང་ཅི་རིགས་པ་འདུག །
en: In general, throughout the present text there are all sorts of unique allusions and variations in the elaboration of the points that are expressed.

source: ཁྱད་པར་གླེང་གཞིའི་སྐབས་ཚིག་སྣ་འགའ་ཞིག་འབུམ་དང་མཐུན་པར་སྣང་ངོ་།། །།༄༅། །ཨོཾ་སྭ་སྟི།
en: In particular, in the chapter entitled “The Introductory Narrative,” there are some passages where the text corresponds to The Perfection of Wisdom in One Hundred Thousand Lines.

source: །ལྷ་དབང་དབང་པོ་སོགས་ཀྱིས་གུས་བསྟེན་པའི། །མི་མཆོག་མཆོག་གི་རྣམ་འདྲེན་སྐུ་གསུམ་བདག །རྣམ་གྲོལ་གྲོལ་བའི་ལམ་དང་ཚོགས་ཀྱི་མཆོག །མ་ལུས་ལུས་ཅན་མགོན་རྣམས་ཕྱག་གི་ཡུལ།
en: OṂ SVĀSTI Respectfully served by Indra, mighty lord of the gods, and others, The supreme guides, best of humankind, embodying the three buddha bodies, Are supreme in liberation, the path of liberation, and the provisions— Objects of homage for all embodied beings and lord protectors.

source: །སྟོང་དང་སྙིང་རྗེ་དབྱེར་མེད་ལྷ་ལམ་ངོས། །ཕྲིན་ལས་ཆུ་འཛིན་འཐུག་པོ་འཁྲིགས་པ་ལས། །ཕན་དང་བདེ་བའི་བདུད་རྩིའི་ཆར་འབེབས་པའི། །སྲས་བཅས་རྒྱལ་བས་སླར་ཡང་དགེ་ལེགས་ས་སྩོལ།
en: In the perspective of the divine path where emptiness and compassion are indivisible, May the conquerors and their heirs again bestow excellent merits, Causing a downpour of nectar of spiritual and temporal well-being From the dense accumulating clouds of enlightened activity!

source: །སྲིད་ཞིའི་རྨད་བྱུང་ཡོན་ཏན་འབྱུང་གནས་མཆོག །མཆོག་གྱུར་ལེགས་གསུངས་དགོས་འདོད་དབང་གི་རྒྱལ། །རྒྱལ་མཚན་ཏོག་ལྟར་མངོན་པར་མཐོ་བའི་རྟེན། །རྟེན་མཆོག་སངས་རྒྱས་བསྟན་པའི་དཔལ་དུ་སྤེལ།
en: The supreme source of the marvelous attributes of existence and quiescence, Monarch of supreme eloquence who reigns over needs and wants, Is a manifestly high support, like the pinnacle of a victory banner— May this supreme support enhance the glory of the Buddhist teaching!

source: །གང་གང་དམན་མཆོག་གདུལ་བྱའི་བྱེ་བྲག་གིས། །མང་མང་ཐེག་པའི་རིམ་པ་མཐའ་ཡས་ཀྱང་། །ངེས་ངེས་སྡེ་སྣོད་གསུམ་དུ་འདུ་བ་ལས། །ཟབ་ཟབ་བར་པ་མཚན་ཉིད་མེད་པའི་བཀའ། །དྲི་ཟའི་ཡུལ་བཞུགས་བྱེ་བ་ཕྲག་བརྒྱ་པ།
en: Although the sequences of the manifold vehicles are infinite Owing to distinctions between disciples, who are low and high, They are subsumed in the three definitive piṭakas, Among which are the profound middle turning precepts Concerning the absence of defining characteristics.

source: །མཆོད་སྦྱིན་བརྒྱ་པའི་གནས་བཞུགས་འབུམ་ཕྲག་བརྒྱ། །གདེངས་ཅན་གྲོང་བཞུགས་སྟོང་ཕྲག་བརྒྱ་པ་ལ། །རྒྱས་པའི་རྒྱས་འབྲིང་བསྡུས་པའི་རྣམ་གཞག་མཛད།
en: Among these, the billion-line version extant in the domain of the gandharvas, The ten-million-line version extant in the domain of Śatakratu, And the hundred-thousand-line version extant in the domain of hooded nāgas Were established as the long, middle-length, and abridged versions of the extensive text.

source: །ཉི་ཁྲི་ཁྲི་བརྒྱད་སྟོང་པ་ཤེས་རབ་ཁྲི། །འབྲིང་གི་རྒྱས་འབྲིང་བསྡུས་པ་ཞེས་སུ་གྲགས།
en: The twenty-five-thousand-line, eighteen-thousand-line, and ten-thousand-line versions Are known as the long, middle-length, and abridged versions of the intermediate text.

source: །བརྒྱད་སྟོང་པ་དང་སྡུད་པ་ཚིགས་བཅད་ལ། །བསྡུས་དང་ཤིན་ཏུ་བསྡུས་ཞེས་མཁས་མང་བཞེད།
en: Many scholars profess that the eight-thousand-line version and the verse summation Are respectively the abridged and extremely abridged texts.

source: །ཡང་ན་འབུམ་དང་ཉི་ཁྲི་བརྒྱད་སྟོང་པ། །རྒྱས་འབྲིང་བསྡུས་པར་ཡོངས་སུ་གྲགས་པ་ལས།
en: Alternatively, the versions in one hundred thousand lines, Twenty-five thousand lines, and eight thousand lines Are respectively known as the long, medium, and short texts.

source: །རྒྱས་པ་རིས་མེད་འགྲོ་བའི་མཆོད་སྡོང་དུ། །འཛད་མེད་དབང་གི་རྒྱལ་པོའི་ཆར་ཕབས་ནས།
en: Among these, the long version fell as a downpour of kingly power, Inexhaustible as an offering lamp for living beings, without partiality.

source: །སླར་ཡང་བསྟན་འགྲོའི་དགེ་ལེགས་སྤེལ་བའི་ཆེད། །སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པའི་རིན་ཆེན་དབྱིག །ཟད་མི་ཤེས་པ་ནམ་མཁའ་མཛོད་ཀྱི་སྒོ། །གྲངས་མེད་གཅིག་ཆར་འབྱེད་པའི་ངོ་མཚར་དཔྱིད། །ཡངས་པའི་སྡེ་ཆེན་དགེ་བཅུའི་འཚོ་བ་ལ། །ལོངས་སུ་སྤྱོད་པའི་སྐལ་བཟང་སྩོལ་བའི་རྗེ། །རིས་མེད་བསྟན་པ་ཡོངས་ཀྱི་སྲི་ཞུ་མཁན། །ཚེ་རིང་དབང་པོའི་ཁེངས་པ་འཕྲོག་བྱེད་དེས། །དཔལ་ལྡན་ས་སྐྱའི་རིང་ལུགས་གདུགས་དཀར་གྱིས།
en: In order that the excellent merit of the teaching and living beings might yet again increase, Lord [Tenpa Tsering], who bestows the good fortune of resources For the sustenance of spacious Degé— A great community endowed with the ten virtuous actions— Instantly opened countless doors of the inexhaustible treasure-store of space, Containing the gems of the twenty-five-thousand-line version—it was a wondrous springtime.

source: །ཡོངས་སུ་ཁྱབ་པའི་ལུགས་གཉིས་མདུན་ས་ཆེ། །ཕྱོགས་ལས་རྣམ་པར་རྒྱལ་བའི་ཆོས་ཀྱི་གྲྭ། །ལྷུན་གྲུབ་སྟེང་གི་ཕོ་བྲང་ཆེན་པོ་རུ། །དགེ་བྱེད་ཆུ་སྟག་ཤེལ་དཀར་དངས་པའི་ངོས། །སྣྲོན་ཟླའི་གཞོན་ནུའི་བཞིན་རས་འཆར་བའི་ཚེ། །རྐོ་བྱེད་རྩེར་སོན་བཅུ་ཕྲག་ཉེར་ལྔ་ཡིས།
en: Acting in service of the entire teaching impartially, Stealing the pride of the mighty long-living [gods], In the great palace of Lhundrubteng, A seminary triumphant over all directions, Bastion of the twofold tradition [of sūtra and tantra] Enveloped by the white parasol of the glorious Sakya school, During the water tiger year, also known as Śubhakṛta, At the time when the youthful face of the Jyeṣṭha moon made her appearance, Her surface resembling translucent crystal, He completed this task with two hundred and fifty elite [wood] carvers Through the excellence of meritorious circumstances.

source: །ལེགས་ཚོགས་རྟེན་འབྲེལ་ཕུན་སུམ་ཚོགས་པས་བསྒྲུབས། །དགེ་དེས་མི་དབང་སྐུ་ཚེ་ཆབ་སྲིད་བསྟན། །ཡངས་པའི་རྒྱལ་ཁམས་རྫོགས་ལྡན་བདེ་བས་འཚོ། །འབྲེལ་ཐོབ་གྱིས་མཚོན་མར་གྱུར་འགྲོ་བ་རྣམས། །རྣམ་གྲོལ་སྐུ་བཞིའི་གོ་འཕང་ཐོབ་ཕྱིར་བསྔོ།
en: By this virtuous action I dedicate merit That king [Tenpa Tsering] might have a long life and stable rule, Sustaining the spacious kingdom with the bliss of the perfect age, And that living beings, exemplified by those with auspicious connections, Might attain the rank of liberation, the four buddha bodies!

source: །ཞེས་སྡེ་དགེ་ས་སྐྱོང་མིའི་དབང་པོ་བསྟན་པ་ཚེ་རིང་གི་ཞལ་སྔ་ནས་སངས་རྒྱས་ཕལ་པོ་ཆེ་དང་འདི་ཉིད་སྟབས་གཅིག་ཏུ་པར་དུ་བསྒྲུབས་པ་གནང་སྐབས། གོ་རེ་ལེན་དགེ་སློང་བཀྲ་ཤིས་དབང་ཕྱུག་གིས་པར་གྱི་ལས་གྲ་ཚུགས་པའི་གནས་ཤར་ཁ་རྫོང་གསར་ཕོ་བྲང་དུ་བྲིས་པ་ཛ་ཡནྟུ།། །།
en: At the time when the carving of the xylographs of this very text, along with those of the Multitude of the Buddhas (Buddhāvataṃsaka), was completed, in the presence of King Tenpa Tsering, the ruler of Degé, the beggar monk Tashi Wangchuk composed these verses at Sharkha Dzongsar Palace, where the wood-carving workshop was based.

source: ཡེ་དྷརྨྨཱ་ཧེ་ཏུ་པྲ་བྷ་ཝཱ་ཧེ་ཏུནྟེ་ཥཱན་ཏ་ཐཱ་ག་ཏོ་ཧྱ་ཝ་དཏ།
en: May they be victorious!
